In [1]:
pip install pandas

Requirement already satisfied: pandas in c:\users\utkar\anaconda3\lib\site-packages (2.1.4)Note: you may need to restart the kernel to use updated packages.

Requirement already satisfied: numpy<2,>=1.23.2 in c:\users\utkar\anaconda3\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\utkar\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\utkar\anaconda3\lib\site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in c:\users\utkar\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\utkar\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [3]:
import pandas as pd

In [5]:
df=pd.read_csv(r"C:\Users\utkar\Downloads\titanic.csv")

In [6]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [9]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [10]:
print(df['Pclass'])

0      3
1      1
2      3
3      1
4      3
      ..
886    2
887    1
888    3
889    1
890    3
Name: Pclass, Length: 891, dtype: int64

In [12]:
print(df.iloc[:5])  #print 5 rows

   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500   NaN        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S
3      0            113803  53.1000  C123        S
4      0            373450   8.0500   NaN        S

In [56]:
# Find the total number of passengers.
count= df['PassengerId'].nunique()
count

891

In [58]:
# Find the average age of passengers.
avg_age= df['Age'].mean()
avg_age

29.69911764705882

In [64]:
# Count passengers based on their class (Pclass).
class_cnt= df.groupby('Pclass').size()
class_cnt

Pclass
1    216
2    184
3    491
dtype: int64

In [112]:
# Count persons who survived
survived= df['Survived'].value_counts().get(0,0)
survived
#What percentage is that of the total?
count_total= df['PassengerId'].nunique()
percentage= (survived/count_total)*100
print(percentage)

61.61616161616161

In [108]:
#What is the ratio of male to female passengers?
male = df['Sex'].value_counts().get('male',0)
female = df['Sex'].value_counts().get('female',0)
print("male:",male,"\n","female:",female)
ratio= male/female
print(ratio)

male: 577
 female: 314
1.8375796178343948

In [122]:
#What is the average fare paid by passengers in each passenger class (Pclass)?
avg= df.groupby('Pclass')['Fare'].mean()
avg

Pclass
1    84.154687
2    20.662183
3    13.675550
Name: Fare, dtype: float64

In [134]:
#How many children (age < 18) were on board, and how many of them survived?
children= df[df.Age<18]
print(len(children))
print(len(children[children.Survived==1]))

113
61

In [148]:
#What is the survival rate for each gender?
survival_rate_gender = df.groupby('Sex')['Survived'].mean()
survival_rate_gender

Sex
female    0.742038
male      0.188908
Name: Survived, dtype: float64

In [156]:
#Which ticket number corresponds to the highest fare?
# Find the row with the highest fare
highest_fare_row = df[df['Fare'] == df['Fare'].max()]

# Extract the ticket number and fare
ticket_number = highest_fare_row['Ticket'].values[0]
highest_fare = highest_fare_row['Fare'].values[0]

# Print the result
print(f"Ticket number: {ticket_number}")
print(f"Highest fare: {highest_fare}")

Ticket number: PC 17755
Highest fare: 512.3292